; domain
(define (domain gripper-strips)
   (:requirements :typing :negative-preconditions)
   (:types
    room graspable gripper - object
    ball cube - graspable)

   (:constants hand - gripper)

   (:predicates (at-robby ?r - room)
		(at ?o - graspable ?r - room)
		(free ?g - gripper)
		(carry ?o - graspable ?g - gripper))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (at-robby ?from)
       :effect (and  (at-robby ?to)
		     (not (at-robby ?from))))



   (:action pick-ball
       :parameters (?obj - ball ?room - room)
       :precondition  (and  (at ?obj ?room) (at-robby ?room) (free hand))
       :effect (and (carry ?obj hand)
		    (not (at ?obj ?room))
		    (not (free hand))))


   (:action drop-ball
       :parameters  (?obj - ball ?room - room )
       :precondition  (and  (carry ?obj hand) (at-robby ?room))
       :effect (and (at ?obj ?room)
		    (free hand)
		    (not (carry ?obj hand))))


    (:action pick-cube
       :parameters (?obj - cube ?room - room )
       :precondition  (and  (at ?obj ?room) (at-robby ?room) (free hand))
       :effect (and (carry ?obj hand)
		    (not (at ?obj ?room))
		    (not (free hand))))


   (:action drop-cube
       :parameters  (?obj - cube ?room - room )
       :precondition  (and  (carry ?obj hand) (at-robby ?room))
       :effect (and (at ?obj ?room)
		    (free hand)
		    (not (carry ?obj hand))))



)

; problem
(define (problem gripper-x-1)
   (:domain gripper-strips)
   (:requirements :typing)
   (:objects rooma roomb - room
             ball1 ball2 - ball
             cube1 cube2 - cube)

   (:init (at-robby rooma)
          (free hand)
          (at cube1 rooma)
          (at cube2 rooma)
          (at ball2 rooma)
          (at ball1 rooma)
    )

   (:goal (and (at cube1 roomb)
               (at cube2 roomb)
               (at ball2 roomb)
               (at ball1 roomb)
          )
    )


)

; plan
1. (pick-ball ball1 rooma)
   deleted: (at ball1 rooma) (free hand)
   added: (carry ball1 hand)
   goals met: 0 of 4
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 4
3. (drop-ball ball1 roomb)
   deleted: (carry ball1 hand)
   added: (at ball1 roomb) (free hand)
   goals met: 1 of 4
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 4
5. (pick-ball ball2 rooma)
   deleted: (at ball2 rooma) (free hand)
   added: (carry ball2 hand)
   goals met: 1 of 4
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 4
7. (drop-ball ball2 roomb)
   deleted: (carry ball2 hand)
   added: (at ball2 roomb) (free hand)
   goals met: 2 of 4
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 4
9. (pick-cube cube1 rooma)
   deleted: (at cube1 rooma) (free hand)
   added: (carry cube1 hand)
   goals met: 2 of 4
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 4
11. (drop-cube cube1 roomb)
   deleted: (carry cube1 hand)
   added: (at cube1 roomb) (free hand)
   goals met: 3 of 4
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 4
13. (pick-cube cube2 rooma)
   deleted: (at cube2 rooma) (free hand)
   added: (carry cube2 hand)
   goals met: 3 of 4
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 4
15. (drop-cube cube2 roomb)
   deleted: (carry cube2 hand)
   added: (at cube2 roomb) (free hand)
   goals met: 4 of 4
